# Basic information

Two types of databases: relational and non-relational
 - relational databases: include things like tables, very structured data: stores data in row and columns
 - non-relational: for unstructured data

### 
<div style="display: flex; gap: 10px;">
  <img src="relational.png" width="1200" height="300"/>
  <img src="non_relational.png" width="600" height="300"/>
</div>

<!-- <div style="display: flex; gap: 10px;">
  <img src="relational.png" style="width: 50%; height: auto;"/>
  <img src="non_relational.png" style="width: 20%; height: auto;"/>
</div>
 -->

Fact tables: Contains the core data for business analysis and measure and record business events (e..g job posting)
Dimension tables: describe attributes or dimensions of the data (skills, companies). It also supports filtering, grouping and labeling of facts in reports.

Basic database for SQLite:  
lukeb.co/sql_jobs_db  
lukeb.co/sql_invoices_db
  
Run: CTRL ENTER or "Run SQL Query" button on the right.<br>
<br>
Order to write commands:  
SELECT  
FROM  
WHERE  
GROUP BY  
HAVING  
ORDER BY ... ASC|DESC  
LIMIT

# Basic Statements and Commands

## Select all columns

SELECT: identifies the columns (or data) from database  
FROM: identifies the table we are connecting to  
*: select all the columns  




SELECT *  
FROM job_posting_fact

## Select specific Columns: put the items under each other separating them by a comma for better readability

SELECT  
&emsp;company_id,  
&emsp;name  
FROM  
&emsp;company_dim

There is a better way for that: make a reference to the table:

SELECT  
&emsp;company_dim.company_id,  
&emsp;company_dim.name  
FROM  
&emsp;company_dim

## Limitation of the outputs

SELECT  
&emsp; company_dim.company_id,  
&emsp; company_dim.name  
FROM  
&emsp; company_dim  
__LIMIT__ 5

## Reading different (dictinct) columns only
List all the different job titles by job_title_short column

__SELECT DISTINCT__  
&emsp; job_postings_fact.job_title_short  
FROM job_postings_fact

## Running more different SQL queries: one below the other separated by semicolon

SELECT DISTINCT  
&emsp; job_postings_fact.job_title_short  
FROM job_postings_fact;  

SELECT DISTINCT  
&emsp; job_postings_fact.salary_year_avg  
FROM job_postings_fact;

!Note, currently with that editor only the last result can be shown. With advanced editor later on the others can also be shown

## Filter out particular data from the output

!WHERE is put right after FROM and the keyword is put between '' and not "".

  - e.g.:I am interested only in a job title, where it is "Data Analyst"

SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
    
FROM  
    &emsp;job_postings_fact  
__WHERE__  
    &emsp;job_title_short = 'Data Analyst'  
LIMIT 10

  -  e.g.: I am interested in job posts of Data Analysts where the salary is above 90000 per year. List only the first 15 hits.

SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
    
FROM  
    &emsp;job_postings_fact  
__WHERE__  
    &emsp;job_title_short = 'Data Analyst' __AND__ salary_year_avg > 90000  
LIMIT 15

## Adding comments

### Single line comment: --. Comment starts with '--', for strings of one line only, can be put anywhere in the query

-- query to see relevant data for DAs  
SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg    
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_title_short = 'Data Analyst' AND salary_year_avg > 90000  
LIMIT 10

### Multi-line comment: E.g. I open a Note section at the beginning of the query why I do that specific query

__/*__ multi  
line  
comment  
__*/__

## Ordering (sorting)

### Sort Ascending, from smallest to largest. ! NULL is the smallest if no values

/*  
Line 1 for multi-comment  
something  
Line 3  
*/  
SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg    
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_title_short = 'Data Analyst'AND salary_year_avg > 90000  
__ORDER BY__  
    &emsp;salary_year_avg  -- you can put here __ASC__, right after the sorting key, but it is not necessary, the default ORDER is ASC  
LIMIT 10

### Sort Descending

/*  
Line 1 for multi-comment  
something  
Line 3  
*/  
SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg    
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_title_short = 'Data Analyst'AND salary_year_avg > 90000  
__ORDER BY__  
    &emsp;salary_year_avg __DESC__  
LIMIT 10

# Comparisons

## Notes:

Used with WHERE and HAVING clause  
Used in conjunction with comparison operators: $=,<>,>,<,<=,>=$  
Used in conjunction with logical operators: __AND,OR,BETWEEN,IN__

## Comparison operators, e.g.: Not equal: select the job_via via not 'via Ai-Jobs.net'

### First solution:  
SELECT  
    &emsp;job_postings_fact.job_id,  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.job_via <> 'via Ai-Jobs.net'

### Second solution:  
SELECT  
    &emsp;job_postings_fact.job_id,  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE __NOT__  
    &emsp;job_postings_fact.job_via = 'via Ai-Jobs.net'

### Note, that double negation works: select the job_via via 'via Ai-Jobs.net'

SELECT  
    &emsp;job_postings_fact.job_id,  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE NOT  
    &emsp;job_postings_fact.job_via <> 'via Ai-Jobs.net'

## Logical operators

### AND: Salary is more than 100000 per year for Data Analysts:

SELECT  
    &emsp;job_postings_fact.job_id,  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.salary_year_avg > 100000  
    &emsp;__AND__ job_postings_fact.job_title = 'Data Analyst'  
ORDER BY  
    &emsp;job_postings_fact.salary_year_avg

### OR: In case of OR, it is permissive OR ( both conditions are allowed,too).  
List the jobs where it is for Data Analyst OR the salary_year_avg > 100000 (so it can be e.g.: Data Analyst with 120000 salary/year)

SELECT  
    &emsp;job_postings_fact.job_id,  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.job_title_short = 'Data Analyst'  
    &emsp;OR job_postings_fact.salary_year_avg > 100000  
ORDER BY  
    &emsp;job_postings_fact.salary_year_avg

### BETWEEN

SELECT  
    &emsp;job_postings_fact.job_id,  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.job_title_short = 'Data Analyst'  
    &emsp;OR job_postings_fact.salary_year_avg BETWEEN 60000 AND 90000  
ORDER BY  
    &emsp;job_postings_fact.salary_year_avg

### IN: Match not to a condition, but to any condition in a list: IN (cond1, cond2, .., condn)

Job titles of Data Analyst or Data Engineer or Data Scientist:  
SELECT  
    &emsp;job_postings_fact.job_id,  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.job_title_short __IN__ ('Data Analyst', 'Data Engineer', 'Data Scientist)

# Practice Problem 1

### Get the job details for BOTH 'Data Analyst' or 'Business Analyst' positions
  - For 'Data Analyst', jobs only > 100.000
  - For 'Business Analyst', jobs only > 70.000
  - Jobs are located either in 'Boston, MA' or 'Anywhere'

SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE  
    &emsp;(
&emsp;&emsp;        (job_postings_fact.job_title_short = 'Data Analyst' AND job_postings_fact.salary_year_avg > 100000)  
&emsp;    OR  
&emsp;&emsp;&emsp;  (job_postings_fact.job_title_short = 'Business Analyst' AND job_postings_fact.salary_rate > 70000)  
&emsp;    )  
&emsp;    AND  
&emsp;        job_postings_fact.job_location IN ('Boston, MA', 'Anywhere')  
&emsp;    AND  
&emsp;        job_postings_fact.salary_year_avg IS NOT NULL  
ORDER BY  
&emsp;    job_postings_fact.salary_year_avg ASC

# Wildcards

## zero or more characters: __LIKE %__. It is as * for bash

### Get all the jobs of 'Analyst'

SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_title,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.job_title LIKE '%Analyst%'  
ORDER BY  
    &emsp;job_postings_fact.salary_year_avg ASC

## single character: **_**

### List the jobs of 'Business Analyst' only. Hint: There is a 'Business Data Analyst' job I am not interested in.

#### First solution

SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_title,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.job_title_short LIKE 'Business_Analyst'  
ORDER BY  
    &emsp;job_postings_fact.salary_year_avg ASC

#### Second solution (does not work in SQLite)

SELECT  
    &emsp;job_postings_fact.job_title_short,  
    &emsp;job_postings_fact.job_title,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.job_via,  
    &emsp;job_postings_fact.salary_year_avg  
FROM   
    &emsp;job_postings_fact  
WHERE  
    &emsp;job_postings_fact.job_title ILIKE '%Business_Analyst%'  
ORDER BY  
    &emsp;job_postings_fact.salary_year_avg ASC

# Aliases: AS

Temporarily rename  
  - a column in a table. It makes the column names more readable. Practical for presentations.
  - works for tables, too.

### Present the following columns in a different name:
job_title_short -> job_title  
job_location -> location  
job_via -> online_platform  
salary_year_avg -> salary

SELECT  
    &emsp;job_postings_fact.job_title_short AS job_title,  
    &emsp;job_postings_fact.job_location AS location,  
    &emsp;job_postings_fact.job_via AS online_platform,  
    &emsp;job_postings_fact.salary_year_avg AS salary  
FROM   
    &emsp;job_postings_fact

### Load job_posting_fact as jpc. Also modify the load of the columns according to it. Give 2 solutions, the second solution is the simpler form of the first one.

#### With AS in FROM
SELECT  
    &emsp;jpc.job_title_short **AS** job_title,  
    &emsp;jpc.job_location AS location,  
    &emsp;jpc.job_via AS online_platform,  
    &emsp;jpc.salary_year_avg AS salary  
FROM  
    &emsp;job_postings_fact **AS** jpc

#### Without AS either in SELECT or FROM. It works but makes it harder read.
SELECT  
    &emsp;jpc.job_title_short job_title,  
    &emsp;jpc.job_location location,  
    &emsp;jpc.job_via online_platform,  
    &emsp;jpc.salary_year_avg salary  
FROM  
    &emsp;job_postings_fact jpc  
<br>
!important note: in this case **jpc**.job_title_short works but **job_postings_fact**.job_title_short does not

# Practice Problem 1

### Look for non-senior data analyst or business analyst roles  
Get the job title, location and average year salary

#### First Solution

SELECT  
    &emsp;job_postings_fact.job_title,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.salary_year_avg  
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;(job_postings_fact.job_title NOT LIKE '%Senior%')  
    &emsp; AND  
     &emsp;(    (job_postings_fact.job_title LIKE '%Data%' OR job_postings_fact.job_title LIKE '%Business%') AND job_postings_fact.job_title LIKE '%Analyst%'  
    &emsp; )

#### Second Solution

SELECT  
    &emsp;job_postings_fact.job_title,  
    &emsp;job_postings_fact.job_location,  
    &emsp;job_postings_fact.salary_year_avg  
FROM  
    &emsp;job_postings_fact  
WHERE  
    &emsp;(job_postings_fact.job_title NOT LIKE '%Senior%')  
    &emsp; AND  
     &emsp;job_postings_fact.job_title_short IN ('Data Analyst', 'Business Analyst')

# Basic Operations

### Here is the core query from lukeb.co/sql_invoices_db

### Addition and subtraction

#### Modify the core query as per follows:  
  - load hours_rate as rate_original
  - subtract 5 from all the values in hours rate column and load it as rate_drop

SELECT  
    &emsp; invoices_fact.project_company,  
    &emsp; invoices_fact.nerd_id,  
    &emsp; invoices_fact.nerd_role,  
    &emsp; invoices_fact.hours_rate AS rate_original,  
    &emsp; invoices_fact.hours_rate - 5 AS rate_drop  
FROM  
    &emsp; invoices_fact

### Multiplication: Get the following from lukeb.co/sql_invoices_db:  
  -  load every column
  -  filter by invoices_fact.hours_spent * invoices_fact.hours_rate > 180000
  -  sort it by nerd_id

#### Solution

SELECT    
    &emsp; *    
FROM    
    &emsp;invoices_fact    
WHERE    
    &emsp;invoices_fact.hours_spent * invoices_fact.hours_rate > 180000    
ORDER BY    
    &emsp;invoices_fact.nerd_id ASC

### Modulus operator. lukeb.co/sql_invoices_db
The task: In general, people work 8 hours a day. Give back an extra_hours column where the overtime value between 8 and 16 working hours(hours_spent).

SELECT  
    &emsp; *,  
    &emsp; invoices_fact.hours_spent % 8 AS extra_hours  
FROM  
    &emsp; invoices_fact  
WHERE  
    &emsp; extra_hours <> 0 AND (invoices_fact.hours_spent BETWEEN 8 AND 16)  
ORDER BY  
    &emsp; extra_hours

# Aggregation: SUM(), COUNT(), AVG(), MAX(), MIN()  
Used in conjunction with GROUP BY and/or HAVING.  
lukeb.co/sql_jobs_db is used

### Add up all the values in salary_year_avg and return with that sum only with name salary_sum

SELECT  
    &emsp; SUM(job_postings_fact.salary_year_avg) AS salary_sum  
FROM  
    &emsp;job_postings_fact

### Modify the query just above as per follows: add the number of rows of the column as count_rows

SELECT  
    &emsp; SUM(job_postings_fact.salary_year_avg) AS salary_sum,  
    &emsp; COUNT(*) as count_rows  
FROM  
    &emsp;job_postings_fact

### Modify the query just above as per follows: add the number of rows of the column where the value is not NULL as count_rows_2

SELECT  
    &emsp; SUM(job_postings_fact.salary_year_avg) AS salary_sum,  
    &emsp; COUNT(*) as count_rows,  
    &emsp; COUNT(job_postings_fact.salary_year_avg) as count_rows_2  
FROM  
    &emsp;job_postings_fact  

  So: COUNT(*) counts every rows; COUNT(<specific column>) counts only the rows where the values are not NULL

### How many different job titles exist?

SELECT  
    &emsp; COUNT(DISTINCT(job_postings_fact.job_title_short)) AS different_jobs  
FROM  
    &emsp; job_postings_fact

### How many part-time job advertisements exist?

SELECT  
    &emsp; COUNT(job_postings_fact.job_schedule_type) AS part_time_jobs  
FROM  
    &emsp;job_postings_fact  
WHERE  
   &emsp;job_postings_fact.job_schedule_type LIKE '%Part-time%'

### What is the yearly average salary for Data Analysts rounded to 2 decimals + what are the mimimum and maximum salary values on a yearly basis?

SELECT   
    &emsp; ROUND(AVG(job_postings_fact.salary_year_avg), 2) AS average_salary_year,  
     &emsp;MIN(job_postings_fact.salary_year_avg) AS salary_min,  
     &emsp;MAX(job_postings_fact.salary_year_avg) AS salary_max  
FROM  
     &emsp;job_postings_fact  
WHERE  
     &emsp;job_postings_fact.job_title_short = 'Data Analyst'

### What is the average, the min and the max salary for all the jobs? Hint: modify the query above

SELECT   
    &emsp; job_postings_fact.job_title_short AS jobs,  
    &emsp; ROUND(AVG(job_postings_fact.salary_year_avg), 2) AS average_salary_year,  
    &emsp; MIN(job_postings_fact.salary_year_avg) AS salary_min,  
    &emsp; MAX(job_postings_fact.salary_year_avg) AS salary_max  
FROM  
    &emsp; job_postings_fact  
GROUP BY  
    &emsp; job_postings_fact.job_title_short

### Add the following query to the above one: get the job number advertisements in total for all the jobs

SELECT   
    &emsp; job_postings_fact.job_title_short AS jobs,  
    &emsp; COUNT(job_postings_fact.job_title_short) AS job_numbers,  
    &emsp; ROUND(AVG(job_postings_fact.salary_year_avg), 2) AS average_salary_year,  
    &emsp; MIN(job_postings_fact.salary_year_avg) AS salary_min,  
    &emsp; MAX(job_postings_fact.salary_year_avg) AS salary_max  
FROM  
    &emsp; job_postings_fact  
GROUP BY  
    &emsp; job_postings_fact.job_title_short

### Make a filter on the query just above: I am only interested in job titles which have more than 100 jobs

SELECT   
    &emsp; job_postings_fact.job_title_short AS jobs,  
    &emsp; COUNT(job_postings_fact.job_title_short) AS job_numbers,  
    &emsp; ROUND(AVG(job_postings_fact.salary_year_avg), 2) AS average_salary_year,  
    &emsp; MIN(job_postings_fact.salary_year_avg) AS salary_min,  
    &emsp; MAX(job_postings_fact.salary_year_avg) AS salary_max  
FROM  
    &emsp; job_postings_fact  
GROUP BY  
    &emsp; job_postings_fact.job_title_short  
HAVING  
    &emsp; job_numbers > 100

#### ! Difference between WHERE and HAVING: WHERE filters Rows (before grouping), HAVING filters Groups (after grouping). Therefore WHERE cannot be used with aggregation.

### Practice Problem 1 (aggregation):
In the job_posting_fact table calculate the total sum of the average yearly salary for all the job posting that are marked as fully remote (job_working_from_home is TRUE)   
and divide it by the total count of salary_year_avg. To get the total average yearly salary for fully remote jobs. Ensure to only include job posting where a yearly salary is specified (not NULL)

SELECT   
    &emsp; job_postings_fact.job_title_short,  
    &emsp; SUM(job_postings_fact.salary_year_avg) AS sum_yearly_avg_salary,  
    &emsp; (SUM(job_postings_fact.salary_year_avg)) / (COUNT(job_postings_fact.salary_year_avg)) as wtf  
FROM  
    &emsp; job_postings_fact  
WHERE  
    &emsp; job_postings_fact.job_work_from_home IS TRUE  
    &emsp; AND  
    &emsp; job_postings_fact.salary_year_avg IS NOT NULL  
GROUP BY  
    &emsp; job_postings_fact.job_title_short

### Practice Problem 2 (aggregation):

In the job_posting_fact table count the total number of job postings that offer health insurance. Use the job_health_insurance column to determine if a job posting offers health insurance

SELECT  
    &emsp; COUNT(job_postings_fact.job_title_short) AS job_health  
FROM  
    &emsp; job_postings_fact  
WHERE  
    &emsp; job_postings_fact.job_health_insurance = '1'

### Practice Problem 3 (aggregation):
In the job_posting_fact table count the number of jobs postings available for each country. Use the job_country column to group the job postings, and count the number of job postings  
(job_id) within each country group.

SELECT  
    &emsp; job_postings_fact.job_country,  
    &emsp; COUNT(job_postings_fact.job_id) AS jobs  
FROM  
    &emsp; job_postings_fact  
GROUP BY  
    &emsp; job_postings_fact.job_country

### Practice Problem 3:  lukeb.co/sql_invoices_db
-  Calculate the current month's total earnings per project (hours_spent * hours_rate)
-  Calculate a scenario where the hourly rate increases by $5

SELECT   
    &emsp; invoices_fact.project_id,  
    &emsp; invoices_fact.hours_spent,  
    &emsp; invoices_fact.hours_rate AS rate_original,  
    &emsp; SUM(invoices_fact.hours_spent * invoices_fact.hours_rate) AS project_original_cost,  /* Calculate the current month's total earnings per project */  
    &emsp; invoices_fact.hours_rate + 5 AS rate_hike,  
    &emsp; SUM(invoices_fact.hours_spent * (invoices_fact.hours_rate + 5)) AS project_projected_cost   /* Calculate a scenario where the hourly rate increases by $5 */  
FROM   
    &emsp; invoices_fact  
GROUP BY  
    &emsp; invoices_fact.project_id

# Null values : Fields with no values.  
Can be filtered out with WHERE or HAVING

### Practice problem 2:  lukeb.co/sql_jobs_db  
Identify all job postings that have neither an annual average salary nor an hourly average salary in the job_posting_fact table. Return job_id, job_title, salary_year_avg, salary_hour_avg

### 1. solution

SELECT  
    &emsp; job_postings_fact.job_id,  
    &emsp; job_postings_fact.job_title,  
    &emsp; job_postings_fact.salary_year_avg,  
    &emsp; job_postings_fact.salary_hour_avg  
FROM  
    &emsp; job_postings_fact  
WHERE  
    &emsp; job_postings_fact.salary_year_avg IS NOT NULL  
    &emsp; AND  
    &emsp; job_postings_fact.salary_hour_avg IS NOT NULL

### 2. solution ( I like it better)

SELECT  
    &emsp; job_postings_fact.job_id,  
    &emsp; job_postings_fact.job_title,  
    &emsp; job_postings_fact.salary_year_avg,  
    &emsp; job_postings_fact.salary_hour_avg  
FROM  
    &emsp; job_postings_fact  
WHERE NOT  
    &emsp; (job_postings_fact.salary_year_avg IS NULL  
    &emsp; OR  
    &emsp; job_postings_fact.salary_hour_avg IS NULL)

# Joins

### LEFT JOIN:

https://www.youtube.com/watch?v=pgHXQ5QerJ0

We have A and B 2 separate tables, and it will return all of the contents table A and then whatever we are matching A and B on.  
it is only going to return the contents, __the entire row!__, from B that is matches A on.   
Think of it like: ""Give me the row from table A, and stick on any matching row from table B â€” with all of its fields."  
In case there is no matching value in B in the common column (say A has value "X" in a row the common column but B has not such value in the common column), then NULL is filled in the corresponding row to B.
<div align="left">
  <img src="sql_left_join.png" width="100" height="50"/>
</div>

#### Join company_name of company_dim table to job_posting_fact using company_id column.

SELECT  
    &emsp;job_postings.job_id,  
    &emsp;job_postings.job_title_short,  
    &emsp;job_postings.company_id AS company_id_A,  
    &emsp;companies.company_id AS company_id_B,  
    &emsp;companies.name AS company_name  
    
FROM job_postings_fact AS job_postings  
LEFT JOIN company_dim AS companies  
    &emsp;ON job_postings.company_id = companies.company_id

### RIGHT JOIN

Returns all rows from the right table and matching rows from the left table. For non-matching rows in the left table, it uses NULL values.
<div align="left">
  <img src="sql_right_join.png" width="100" height="50"/>
</div>

### INNER JOIN

https://www.youtube.com/watch?v=pgHXQ5QerJ0

We have A and B table and it returns rows from the A table that have the corresponding row in B table.  
<div align="left">
  <img src="sql_inner_join.png" width="100" height="50"/>
</div>  
In case A has more columns that match with the same common value in B then the result comes back with all the columns A has, e.g.:  
A table : m = a1, a2, a3, a4, a5   
f = 1, 2, 2, 3, 3   
<br>
n = b1, b2, b3, b4, b5  
f = 1, 2, 3, 4 ,5  

INNER JOIN B ON A.f = B.f WHERE A.f = 2 will be  

| m  | A.f | n  | B.f |
|----|-----|----|-----|
| a2 | 2   | b2 | 2   |
| a3 | 2   | b2 | 2   |

#### I am interested in jobs where a skill is available  
Here 3 tables should be inner joined: job_postings_fact, skills_job_dim and skills_dim

SELECT  
    &emsp; job_postings_fact.job_id,  
    &emsp; job_postings_fact.job_title,  
    &emsp; skills_job_dim.skill_id,  
    &emsp; skills_dim.skills  
FROM  
    &emsp; job_postings_fact  
INNER JOIN skills_job_dim  
    &emsp; ON job_postings_fact.job_id = skills_job_dim.job_id  
INNER JOIN skills_dim  
    &emsp; ON skills_job_dim.skill_id = skills_dim.skill_id

### FULL OUTER JOIN

<div align="left">
  <img src="sql_full_outer_join.png" width="100" height="50"/>
</div>  
Joining 2 tables, returns all rows from the first and second tables. If there are no matching rows in one of the tables, it uses NULL to represent the missing values.SQlite does not support it natively but it can be simulated using a combination of LEFT JOIN, RIGHT JOIN, and UNION. 
Real world use case can be stock taking, when a company has multiple shops in multiple locations and would like to see the consolidated view of inventory.

### Practice Problem 1  
Retrieve the list of job titles(job_title) and the corresponding company names (name) for all job postings that mention "Data Scientist" in the job title. Use the job_posting_fact and company_dim tables for this query.

SELECT  
    &emsp;job_postings_fact.job_title,  
    &emsp;company_dim.name AS company_name  
FROM job_postings_fact  
LEFT JOIN company_dim  
    &emsp;ON job_postings_fact.company_id = company_dim.company_id  
WHERE  
    &emsp;job_postings_fact.job_title
    &emsp;LIKE '%Data Scientist%'

### Practice Problem 2:
Fetch all job postings, including their job titles (job_title) and the names of the skills required (skills), even if no skills are listed for a job. Ensure that the job is located in "New York" and offers "Health Insurance".  
Use the job_posting_fact, skills_job_dim and skills_dim tables.

SELECT  
    &emsp; job_postings_fact.job_title,  
    &emsp; job_postings_fact.job_health_insurance,  
    &emsp; job_postings_fact.job_location,  
    &emsp; skills_dim.skills
    
FROM   
    &emsp; job_postings_fact  
    
LEFT JOIN skills_job_dim ON job_postings_fact.job_id = skills_job_dim.job_id  
LEFT JOIN skills_dim ON skills_dim.skill_id = skills_job_dim.skill_id  

WHERE  
    &emsp; job_postings_fact.job_location = 'New York'  
    &emsp; AND  
    &emsp; job_postings_fact.job_health_insurance = '1'

  Note: The same result can be achieved with INNER JOINs

# Order of execution

### Order or writing

1. SELECT
2. FROM
3. JOINs
4. WHERE
5. GROUP BY
6. HAVING
7. ORDER BY
8. LIMIT

### Order of Execution

1. FROM  
2. JOIN (combined with FROM as part of building the dataset)  
3. WHERE (filters rows before grouping)  
4. GROUP BY (groups the filtered rows)  
5. HAVING (filters groups after grouping)
6. SELECT (picks the columns or expressions to return)
7. ORDER BY (sorts the result set)
8. LIMIT (restricts the number of rows returned)

# Practice problem 5

Find the average salary and number of jobs postings for each skill for this:    
-  Write a query to list each unique skill from the skills_dim table
-  Count how many job postings mention each skill from the skills_job_dim table
-  Calculate the average yearly salary for job postings associated with each skill
-  Group the results by the name of the skill name
-  Order by average salary  
Hint: use LEFT JOIN to combine skills_dim, skills_job_dim and job_posting_fact tables

### Solution

/* skills_dim table has skills and skill_id columns  
skill-job dim table has skill_id and job_id columns  
job fact table has job_id and salary_year_avg columns, so  
import skills_dim table first then left join skill-job dim table and job_postings_fact tables  
*/


SELECT  
    &emsp; DISTINCT(skills_dim.skills) AS skill_name,  
    &emsp; COUNT(skills_job_dim.job_id) AS number_of_job_postings,  
    &emsp; AVG(job_postings_fact.salary_year_avg) AS avg_yearly_salary_per_skill  
FROM skills_dim  
LEFT JOIN skills_job_dim ON skills_dim.skill_id = skills_job_dim.skill_id  
LEFT JOIN job_postings_fact ON job_postings_fact.job_id = skills_job_dim.job_id  
GROUP BY  
    &emsp; skills_dim.skills  
ORDER BY avg_yearly_salary_per_skill DESC

# ADVANCED; PostgreSQL

VSCode, SQLTools(VSCode extension) and pgAdmin 4 is installed and configured. VScode is used to manipulate tables.  
How to run: When a piece of code is written then select all the code part then hit 'CTRL+ E ' twice.

## Manipulate tables

- __CREATE TABLE__  
- __INSERT INTO__: add columns/data to your tables  
- ALTER TABLE:  
     &emsp; __ADD COLUMN__  
     &emsp; __RENAME COLUMN__  
     &emsp; __ALTER COLUMN__: change the datatype of the column  
     &emsp; __DROP COLUMN__: delete a column  
- __DROP TABLE__: delete table
- __UPDATE__ -> SET with WHERE: modify existing data in a row
- __ALTER TABLE__ -> ALTER COLUMN: modify properties of a column
- __DELETE FROM__ with WHERE: delete certain rows

### CREATE TABLE: Table creation

Creating a table of 'job_applied' with a couple of columns:

CREATE TABLE job_applied (  
    &emsp;job_id INT,  
    &emsp;application_sent_date DATE,  
    &emsp;custom_resume BOOLEAN,  
    &emsp;resume_file_name VARCHAR(255),  
    &emsp;cover_letter_sent BOOLEAN,  
    &emsp;cover_letter_file_name VARCHAR(255),  
    &emsp;status VARCHAR(50)  
);

### INSERT INTO: Insert data into a table.   
Used to fill table with new rows if the columns exist; it creates new rows with the new data.  
Cannot be used with WHERE. In case data is already set then use UPDATE to fill the cells.

INSERT INTO table_name (column_name1, column_name2, ...)  
VALUES  
( 1st_value_for_column_name1, 1st_value_for_column_name2,...),  
( 2nd_value_for_column_name1, 2nd_value_for_column_name2,...),  
( 3rd_value_for_column_name1, 3rd_value_for_column_name2,...)  
...  
;

INSERT INTO job_applied (  
   &emsp; job_id,  
   &emsp; application_sent_date,  
   &emsp; custom_resume,  
   &emsp; resume_file_name,  
   &emsp; cover_letter_sent,   
   &emsp; cover_letter_file_name,   
   &emsp; status)  
VALUES (  
   &emsp; 1,  
   &emsp; '2024-02-01',  
   &emsp;  TRUE,  
   &emsp; 'resume_01.pdf',  
   &emsp; TRUE,  
   &emsp; 'cover_letter_01.pdf',  
   &emsp;'submitted'),  
   &emsp; (2,  
   &emsp; '2024-02-02',  
   &emsp; FALSE,  
   &emsp; 'resume_02.pdf',  
   &emsp;FALSE,  
   &emsp; NULL,  
   &emsp; 'interview_scheduled'),  
   &emsp; (3,  
   &emsp; '2024-02-03',  
   &emsp; TRUE,  
   &emsp; 'resume_03.pdf',  
   &emsp; TRUE,  
   &emsp;'cover_letter_03.pdf',  
   &emsp;'ghosted'),  
   &emsp; (4,  
   &emsp; '2024-02-04',  
   &emsp; TRUE,  
   &emsp; 'resume_04.pdf',  
   &emsp; FALSE,  
   &emsp; NULL,  
   &emsp; 'submitted'),  
   &emsp; (5,  
   &emsp;'2024-02-05',  
   &emsp; FALSE,  
   &emsp; 'resume_05.pdf',  
   &emsp; TRUE,  
   &emsp; 'cover_letter_05.pdf',  
   &emsp;  'rejected');

### ALTER TABLE

#### ADD COLUMN: Add a new column to the table

ALTER TABLE job_applied  
ADD COLUMN contact VARCHAR(50);

#### RENAME COLUMN: rename an existing column

ALTER TABLE job_applied  
RENAME COLUMN application_sent_data TO application_sent_date;

#### DROP COLUMN: Delete an existing column

ALTER TABLE job_applied  
DROP COLUMN cover_letter_file_name,  
DROP COLUMN status;

### UPDATE: Used to modify existing data in a column of a table. Condition can be set to filter what values are affected.

#### We have just added the 'contact' column, it has no value in any row. Fill this column up.  
  
UPDATE job_applied  
SET contact = 'Erlish Bachman'  
WHERE job_id = 1;  

UPDATE job_applied  
SET contact = 'Dinesh Chugtai'  
WHERE job_id = 2;  

UPDATE job_applied  
SET contact = 'Bertram Gilfoyle'  
WHERE job_id = 3;  

UPDATE job_applied  
SET contact = 'Jiang Yang'  
WHERE job_id = 4;  

UPDATE job_applied  
SET contact = 'Big Head'  
WHERE job_id = 5;

#### Modify contact 'Dinesh Chugtai' to 'Dienesh Chugtai'

UPDATE job_applied  
SET contact = 'Dinesh Chugtai'  
WHERE contact = 'Dienesh Chugtai';

!Note: The modified column is moved to the end of the database

### ALTER COLUMN: used to modify the properties of an existing column in a table

#### Change data type: Modify the column's data type, subject to compatibility between the old and the new types  
ALTER TABLE table_name  
ALTER COLUMN column_name TYPE new_data_type;

##### Modify the 'contact name' column type to TEXT (no length limitation)

ALTER TABLE job_applied  
ALTER COLUMN contact_name TYPE TEXT;

#### Set/Change default value: Assign a default value to the column, which will be used for new rows if no value is specified  
ALTER TABLE table_name  
ALTER COLUMN column_name SET DEFAULT default_value;

#### Drop default value: Remove the default value from the column if one exists  

ALTER TABLE table_name  
ALTER COLUMN column_name DROP DEFAULT;

### Deleting full rows where the condition(s) is/are met.

DELETE FROM table_name  
WHERE condition(s)

#### Delete rows where 'user_ID' and 'Sex' columns are not filled.

DELETE FROM job_applied  
WHERE user_ID IS NULL and sex IS NULL;

## Handling Dates

__:: DATE__ : Converts to a date format by removing the time portion  
__AT TIME ZONE__: Converts a timestamp to a specified time zone  
__EXTRACT__: GET specific date parts (e.g. year, month, day)

#### Get the date only in timestamp value: ::DATE.  
Timestamp: date and time without timezone, format: YYYY-MM-DD HH:MM:SS  
Timestamp with timezone: date and time + timezone, format: YYYY-MM-DD HH:MM:SS+HH:MM, e.g. 2025-07-08 16:07:05+01:00

In case of  
SELECT  
   &emsp; job_title_short AS title,  
    &emsp;job_location AS location,  
    &emsp;job_posted_date AS date  
FROM job_postings_fact  
LIMIT 10;  

The 'date' column is of timestamp format (date + time).

##### Let's get the date part only (remove the time part)

SELECT  
   &emsp; job_title_short AS title,  
    &emsp;job_location AS location,  
    &emsp;job_posted_date __::DATE__ AS date  
FROM job_postings_fact  
LIMIT 10;

#### AT TIME ZONE : converts timestamps between different time zone

##### Add 'CEST' timezone information to job_posting_fact.job_posted_date as date_with_timezone.  
Note: the solution is not entirely correct, since some times show up as (original time + 02), others are (original time - 1)+01

SELECT   
    &emsp; job_title_short AS title,  
    &emsp;job_location AS location,  
    &emsp;job_posted_date __AT TIME ZONE 'CEST'__ AS date_with_timezone  
FROM job_postings_fact  
LIMIT 10;

##### Show the times as in timezone 'CEST'. So the times should be increased + 2 hours (since it is now July)

SELECT   
  &emsp;  job_title_short AS title,  
   &emsp; job_location AS location,  
  &emsp;  job_posted_date,  
   &emsp; job_posted_date __AT TIME ZONE 'UTC' AT TIME ZONE 'CEST'__ AS date_with_timezone  
FROM job_postings_fact  
LIMIT 10;

#### EXTRACT(<date/time value> FROM table_name): used as a function in SELECT to extract date information (year, month, day, hour, minute, second) from date/time value

##### Extract year, month, day, hour, minute, second values from the date column and put them in a separate column

SELECT   
  &emsp;  job_title_short AS title,  
   &emsp; job_location AS location,  
   &emsp; job_posted_date,  
  &emsp;  EXTRACT(YEAR FROM job_posted_date) AS year,  
   &emsp; EXTRACT(MONTH FROM job_posted_date) AS month,  
   &emsp; EXTRACT(DAY FROM job_posted_date) AS day,  
   &emsp; EXTRACT(HOUR FROM job_posted_date) AS hour,  
   &emsp; EXTRACT(MINUTE FROM job_posted_date) AS minute,  
   &emsp; EXTRACT(SECOND FROM job_posted_date) AS second  
FROM job_postings_fact  
LIMIT 10;

#### Exercise: How many job postings are trending from month to month to Data Analysts only?

SELECT   
   &emsp; EXTRACT(MONTH FROM job_posted_date) AS month,  
   &emsp; COUNT(job_id) AS job_count  
FROM job_postings_fact  
WHERE job_title_short = 'Data Analyst'  
GROUP BY month  
ORDER BY job_count

#### TO CHAR(): to extract the month name directly instead of EXTRACT(). So it gives back the name of the month instead of the number of the month.  
Note: The returning value is padded with spaces (trailing spaces like 'May '). In case the trimmed version is needed then embed the TO CHAR function in TRIM.  
Format: SELECT TRIM(TO_CHAR(column_name, 'Month')) AS month_name

##### Exercise: Let's refine the exercise above. The values of the months are numbers. Modify the query above to show the name of the month not the relevant order number, so in case on month 5 it should be shown up as May.

SELECT   
   &emsp; TRIM(TO_CHAR(job_posted_date, 'Month')) AS month_name,  
   &emsp;COUNT(job_id) AS job_count  
FROM job_postings_fact  
WHERE job_title_short = 'Data Analyst'  
GROUP BY month_name  
ORDER BY job_count

#### Practice Problem 1  
  
Work in job_posting_fact table. Write a query to find the average salary (rounded to 3 decimal points) both yearly and hourly for jobs that were posted after June 1 , 2023. Group the results by job schedule type.

##### Solution

SELECT   
   &emsp; job_schedule_type,  
    &emsp; ROUND(AVG(salary_year_avg), 3) AS avg_salary,  
    &emsp; ROUND(AVG(salary_hour_avg), 3) AS avg_hourly_salary  
FROM job_postings_fact  
WHERE job_posted_date >= '2023-06-01'  
GROUP BY job_schedule_type;

#### Practice Problem 2 - First version

Write a query to count the number of job postings for each month in 2023, adjusting the job_posted_date to be in'EDT' time zone before extracting the month.  
Assume the job_posted_date is stored in UTC. Group by and order by the month.
!Here represent the months by their number

##### Solution

SELECT  
 &emsp;   COUNT(job_id) AS job_count,  
  &emsp;  EXTRACT(MONTH FROM job_posted_date AT TIME ZONE 'UTC' AT TIME ZONE 'EDT') AS month
FROM job_postings_fact  
GROUP BY month  
ORDER BY month;

#### Practice Problem 2 - Second version

Refine the First version by adding the name of the months as new column. So here we have the number of the months and the name of the months.

SELECT  
  &emsp;  COUNT(job_id) AS job_count,  
  &emsp; TRIM(TO_CHAR(job_posted_date AT TIME ZONE 'UTC' AT TIME ZONE 'EDT', 'Month')) AS month_name,  
  &emsp;  EXTRACT(MONTH FROM job_posted_date AT TIME ZONE 'UTC' AT TIME ZONE 'EDT') AS month_number  
FROM job_postings_fact  
GROUP BY month_name, month_number  
ORDER BY month_number;

#### Practice Problem 2 - Third version

Refine the Second version. The Second version is not quite good since the number of months column seems to be superfluous and the ordering is alphabetical.  
Fix it by removing the number of months column and make the ordering by the order of the months they appear in the calendar (= month number).

SELECT  
   &emsp; COUNT(job_id) AS job_count,  
   &emsp; TRIM(TO_CHAR(job_posted_date AT TIME ZONE 'UTC' AT TIME ZONE 'EDT', 'Month')) AS month_name  
FROM job_postings_fact  
GROUP BY month_name, EXTRACT(MONTH FROM job_posted_date AT TIME ZONE 'UTC' AT TIME ZONE 'EDT')  
ORDER BY EXTRACT(MONTH FROM job_posted_date AT TIME ZONE 'UTC' AT TIME ZONE 'EDT');

#### Practice Problem 3  

Write a query to find companies (include company name) that have posted jobs offering health insurance,  
where these postings were made in the second quarter of 2023. Use data extraction to filter by quarter.

##### Solution

SELECT DISTINCT  
   &emsp; name AS company_name  
FROM company_dim  
LEFT JOIN job_postings_fact  
ON job_postings_fact.company_id = company_dim.company_id  
WHERE job_health_insurance = TRUE AND  
      job_posted_date >= '2023-07-01';

#### Practice Problem 6  

Create 3 tables where the job posted date is from the appropriate month:  
- Jan 2023 Jobs
- Feb 2023 Jobs
- Mar 2023 Jobs

##### Solution

CREATE TABLE jobs_2023_jan AS  
&emsp; SELECT *  
&emsp; FROM job_postings_fact  
&emsp; WHERE EXTRACT(MONTH FROM job_posted_date) = 1;

CREATE TABLE jobs_2023_feb AS  
&emsp; SELECT *  
&emsp; FROM job_postings_fact  
&emsp; WHERE job_posted_date >= '2023-02-01' AND job_posted_date < '2023-03-01';

CREATE TABLE jobs_2023_mar AS  
&emsp; SELECT *  
&emsp; FROM job_postings_fact  
&emsp; WHERE EXTRACT(MONTH FROM job_posted_date) = 3;

## Case Expressions: A way to apply conditional logic within your SQL queries.

Similar to IF statement in Python. Commonly used in a SELECT statement but can be also in others,too like WHERE or GROUP BY.  
Format:  
SELECT  
&emsp; CASE  
&emsp;&emsp; WHEN column_name = 'Value1' THEN 'Description for Value1'  
&emsp;&emsp; WHEN column_name = 'Value2' THEN 'Description for Value2'  
&emsp;&emsp; ELSE 'Other'  -- Optional  
&emsp;END AS column_description  
FROM  
&emsp;table_name;

#### Exercise: Create a new column(location category) in job_posting_fact where the value in each row depends on some criteria as per follows:  
  
- In case the job_location is 'Anywhere', then be the value 'Remote'
- In case the job_location is 'New York, NY', then be the value 'Local'
- In every other case the value is 'Onsite

##### Solution  

SELECT   
  &emsp;  job_title_short,  
  &emsp;  job_location,  
  &emsp;  CASE  
  &emsp;&emsp;      WHEN job_location = 'Anywhere' THEN 'Remote'  
  &emsp;&emsp;     WHEN job_location = 'New York, NY' THEN 'Local'  
  &emsp;&emsp;     ELSE 'Onsite'  
  &emsp;&emsp;     END AS location_category  
FROM job_postings_fact;

#### Exercise: Refine the previous exercise. How many Data Analyst jobs are there for 'Remote', 'Local' and 'Onsite'?

SELECT   
   &emsp; CASE  
   &emsp;&emsp;     WHEN job_location = 'Anywhere' THEN 'Remote'  
   &emsp;&emsp;     WHEN job_location = 'New York, NY' THEN 'Local'  
   &emsp;&emsp;    ELSE 'Onsite'  
   &emsp;&emsp;     END AS location_category,  
    &emsp;COUNT(job_id) AS job_count  
FROM job_postings_fact  
WHERE  
    &emsp;job_title_short = 'Data Analyst'  
GROUP BY location_category;

#### Practice Problem 1

Categorize the salaries from each job posting. To see if it fits in my desired salary range.
- Put salary into different buckets
- Define what is a high, standard or low salary with our own conditions: -50.000: Low, 50.000-120.000 Medium, 120.000- High.
- Why? It is easy to determine which job postings are worth looking at based on salary. Bucketing is a common practice in data analysis when viewing categories.
- I only want to look at Data Analyst roles and when the yearly salary is filled.
- Order from highest to lowest.
- Represent the job, the location and the salary_year_avg, too.

##### Solution

SELECT   
  &emsp;   job_title_short,  
  &emsp;  job_location,  
  &emsp;  salary_year_avg,  
  &emsp;  CASE  
  &emsp;&emsp;      WHEN salary_year_avg < 50000 THEN 'Low'  
  &emsp;&emsp;      WHEN salary_year_avg BETWEEN 50000 AND 120000 THEN 'Medium'  
  &emsp;&emsp;      WHEN salary_year_avg > 120000 THEN 'High'  
  &emsp;&emsp;      ELSE 'Unknown'  
  &emsp;  END AS salary_category  
FROM job_postings_fact  
WHERE   
  &emsp;  salary_year_avg IS NOT NULL AND  
  &emsp;   job_title_short = 'Data Analyst'  
ORDER BY salary_year_avg DESC

## Subqueries and Common Table Expressions(CTEs)

Used for organizing and simplying complex queries.   
The conceps behind them is to create 'temporary result sets' inside the SQL query that we are performing and then perform and then analysis on this temporary result set.  

- Helps break down the query into smaller, more manageable parts

When to use one over the other?
- Subqueries are for simpler queries. Nested inside a larger query. __Use it when performance is critical__. It can be used in SELECT, FROM and WHERE clauses.
- __Can only be used within the same outer query where it is defined, cannot be used across multiple queries.__  
- CTEs are for more complex queries. Use it when recursion is needed.

#### Subqueries

The result is not stored, only for viewing. For simpler queries. Nested inside a larger query. It can be used in SELECT, FROM, WHERE, HAVING and JOIN clauses.  
  
We have created previously a new table on job_postings posted on January, February and March.  
In case we do not need a new table on them only just to show the results on the screen by a query, then we can use a subquery.

##### Exercise 1: Create a 'temporary table/temporary result set' for viewing to get the jobs posted on January from job_postings_fact. Order it by the date.

###### Solution #1

SELECT *  
FROM   
  &emsp;  (  
   &emsp;     SELECT *  
    &emsp;    FROM job_postings_fact  
   &emsp;     WHERE EXTRACT(MONTH FROM job_posted_date) = 1  
 &emsp;   )  
 &emsp;   AS january_jobs  
ORDER BY january_jobs.job_posted_date;

###### Solution #2

SELECT *  
FROM   
  &emsp;  (  
   &emsp;     SELECT *  
    &emsp;    FROM job_postings_fact  
   &emsp;     WHERE job_posted_date >= '2023-01-01' AND job_posted_date < '2023-02-01'    
 &emsp;   )  
 &emsp;   AS january_jobs  
ORDER BY january_jobs.job_posted_date;

###### Solution #3

SELECT *  
FROM   
  &emsp;  (  
   &emsp;     SELECT *  
    &emsp;    FROM job_postings_fact  
   &emsp;     WHERE TRIM(TO_CHAR(job_posted_date, 'Month')) = 'January'    
 &emsp;   )  
 &emsp;   AS january_jobs  
ORDER BY january_jobs.job_posted_date;

#### Exercise 2: Create a subquery to list all the companies that posted jobs in January. Count the jobs posted in January for every company, too. Which company offers the most jobs?

SELECT   
  &emsp;  company_dim.name AS company_name,  
   &emsp; january_jobs.jan_postings  
FROM   
&emsp;(  
   &emsp; SELECT company_id, COUNT(*) AS jan_postings  
   &emsp; FROM job_postings_fact  
   &emsp; WHERE EXTRACT(MONTH FROM job_posted_date) = 1  
   &emsp; GROUP BY company_id  
&emsp;)   
&emsp;AS january_jobs  
JOIN company_dim ON company_dim.company_id = january_jobs.company_id  
ORDER BY january_jobs.jan_postings DESC;

#### Exercise 3: Get a list of companies that are offering jobs that do not have any requirements for a degreeÂ¶.

##### Solution # 1

SELECT  
   &emsp; company_dim.name AS company_name  
FROM company_dim  
WHERE company_dim.company_id IN (  
   &emsp;  SELECT company_id  
    &emsp; FROM job_postings_fact  
    &emsp; WHERE job_no_degree_mention = TRUE  
);

##### Solution # 2. The same as # 1 above, but more complicated and possible consumes more resources

SELECT  
&emsp;    name AS company_name   
FROM (  
&emsp;     SELECT DISTINCT  
 &emsp; &emsp;        company_id,  
 &emsp; &emsp;        job_postings_fact.job_no_degree_mention  
 &emsp;    FROM job_postings_fact  
 &emsp;    WHERE  
 &emsp; &emsp;        job_postings_fact.job_no_degree_mention IS TRUE  
 &emsp;    GROUP BY job_postings_fact.company_id, job_postings_fact.job_no_degree_mention  
    )  
AS no_degree_companies  
JOIN company_dim ON no_degree_companies.company_id = company_dim.company_id  
ORDER BY company_name  
;

#### Exercise # 4

- Select the jobs posted in January and count them. Group it by company id. This is the subquery.
- Join the company_dim table and show the name of the company and how many jobs are posted.
- Order by count

##### Solution

SELECT   
   &emsp; company_dim.name AS company_name,  
   &emsp; january_jobs.jan_postings  
FROM   
    &emsp;(  
   &emsp; SELECT company_id,   
   &emsp; COUNT(job_postings_fact.job_id) AS jan_postings  
   &emsp; FROM job_postings_fact  
  &emsp;  WHERE EXTRACT(MONTH FROM job_posted_date) = 1  
   &emsp; GROUP BY company_id  
    &emsp;)   
    &emsp;AS january_jobs  
JOIN company_dim ON company_dim.company_id = january_jobs.company_id   
ORDER BY january_jobs.jan_postings DESC;

### CTEs

Define a temporary result set that you can reference. Can be used within SELECT, INSERT, UPDATE or DELETE.  
Defined with WITH 'name'...AS 'CTE definition' at the beginning of a query.

#### Exercise 4: The same as exercise 1: Create a CTE for viewing to get the jobs posted on January. Order it by the date.

###### Solution

- First do the CTE; name it: Select the jobs posted in January  
- Finish the query; refer to the CTE

WITH january_jobs AS   
  &emsp;  (  
   &emsp; SELECT *  
   &emsp; FROM job_postings_fact  
   &emsp; WHERE EXTRACT(MONTH FROM job_posted_date) = 1  
  &emsp;  )  

SELECT *  
FROM january_jobs  
ORDER BY job_posted_date;

#### Exercise 5. Same as Exercise 3 but with CTE: get a list of companies that are offering jobs that do not have any requirements for a degreeÂ¶

##### Solution

- Pick all the company ids which do not require a degree and put it to a temporary result set. Name that set.
- Stick together that new temp table and company dim and get the company names.

WITH no_degree_jobs AS  
 &emsp;   (  
 &emsp;   SELECT company_id  
  &emsp;  FROM job_postings_fact  
  &emsp;  WHERE job_no_degree_mention = TRUE  
    )  

SELECT  
  &emsp;  company_dim.name AS company_name  
FROM no_degree_jobs  
LEFT JOIN company_dim  
 &emsp;  ON no_degree_jobs.company_id = company_dim.company_id;

#### Exercise 6. Find the companies that have the most job openings.

##### Solution

WITH count_job_postings AS  
  &emsp;  (  
  &emsp;  SELECT  
  &emsp;  company_id,  
  &emsp;  COUNT(*) AS job_count -- counts every row  
FROM job_postings_fact  
GROUP BY company_id  
 &emsp;   )  
  
SELECT  
  &emsp;  company_dim.name AS company_name,  
  &emsp;  count_job_postings.job_count  
FROM company_dim  
LEFT JOIN count_job_postings ON company_dim.company_id = count_job_postings.company_id  
ORDER BY count_job_postings.job_count DESC;

#### Practice Problem 1: Identify the top 5 skills that are most frequently mentioned in job postings.

##### Solution

job_id, skill_id(skills_job_dim)->skill_id, skills(skills_dim)

###### With subquery

SELECT  
  &emsp;  sd.skill_id,  
  &emsp;  sd.skills,  
   &emsp; top_skills.skill_count  
FROM   
  &emsp;  (  
  &emsp;  SELECT  
  &emsp;&emsp;      skill_id,  
  &emsp;&emsp;      COUNT(*) AS skill_count  
  &emsp;  FROM skills_job_dim  
  &emsp;  GROUP BY skill_id  
  &emsp;  ORDER BY skill_count DESC  
  &emsp;  LIMIT 5  
  &emsp;  )  
  &emsp;  AS top_skills  
JOIN skills_dim sd ON top_skills.skill_id = sd.skill_id  
ORDER BY skill_count DESC   
;

###### With CTE

WITH top_skills AS  
  &emsp;  (  
   &emsp; SELECT skill_id,   
   &emsp; COUNT(*) AS skill_count  
   &emsp; FROM skills_job_dim  
   &emsp;  GROUP BY skill_id  
   &emsp;  ORDER BY skill_count DESC  
   &emsp;  LIMIT 5   
  &emsp;  )  
SELECT   
    &emsp; top_skills.skill_id,  
  &emsp;  skills_dim.skills,  
  &emsp;  top_skills.skill_count  
FROM skills_dim  
LEFT JOIN top_skills ON skills_dim.skill_id = top_skills.skill_id  
ORDER BY top_skills.skill_count DESC  
;

#### Practice Problem 2

Determine the size category('Small', 'Medium', 'Large') for each company by first identifyig the number of job postings they have.  
A company is considered 'Small' if it has less than 10 job postings, 'Medium' if the number of job postings is between 10 and 50,  
and 'Large' if it has more than 50 job postings.

##### Solution # 1 with subqueries(derived table)

SELECT  
 &emsp;   company_dim.name AS company_name,  
  &emsp;  COALESCE(job_postings.job_count, 0) AS job_count,  
  &emsp;  -- COALESCE: Replaces NULL with 0 for companies with no postings  
  &emsp;  CASE  
 &emsp;&emsp;       WHEN COALESCE(job_postings.job_count, 0) < 10 THEN 'Small'   
 &emsp;&emsp;       WHEN COALESCE(job_postings.job_count, 0) BETWEEN 10 AND 50 THEN 'Medium'  
 &emsp;&emsp;       WHEN COALESCE(job_postings.job_count, 0) > 50 THEN 'Large'  
 &emsp;   END AS company_size  
FROM company_dim  
LEFT JOIN (  
&emsp;    SELECT  
  &emsp;&emsp;      company_id,  
 &emsp;&emsp;       COUNT(job_id) AS job_count   
 &emsp;   FROM job_postings_fact  
&emsp;    GROUP BY company_id  
) AS job_postings ON company_dim.company_id = job_postings.company_id  
ORDER BY job_count DESC;

##### Solution # 2 with subqueries(derived table)

SELECT  
&emsp;    company_dim.name AS company_name,  
 &emsp;    comp_jobs.job_count,  
 &emsp;    CASE  
 &emsp; &emsp;        WHEN job_count < 10 THEN 'Small'  
 &emsp; &emsp;        WHEN job_count BETWEEN 10 AND 50 THEN 'Medium'  
 &emsp; &emsp;        WHEN job_count > 50 THEN 'Large'  
 &emsp;    END AS Company_size  
FROM(  
 &emsp;    SELECT   
 &emsp; &emsp;        job_postings_fact.company_id,  
 &emsp; &emsp;        COUNT(job_postings_fact.job_id) AS job_count  
 &emsp;    FROM job_postings_fact  
 &emsp;    GROUP by company_id  
)  
AS comp_jobs  
JOIN company_dim ON comp_jobs.company_id = company_dim.company_id  
ORDER BY comp_jobs.job_count DESC  
;

##### Solution # 3 with CTE

WITH job_postings AS  
  &emsp;  (  
   &emsp; SELECT  
  &emsp;  company_id,  
  &emsp;  COUNT(job_id) AS job_count  
  &emsp;  FROM job_postings_fact  
  &emsp;  GROUP BY company_id  
  &emsp;  )     

SELECT  
  &emsp;  company_dim.name AS company_name,  
  &emsp;  job_postings.job_count,  
  &emsp;  CASE  
  &emsp;&emsp;      WHEN COALESCE(job_postings.job_count, 0) < 10 THEN 'Small'  
   &emsp;&emsp;     WHEN COALESCE(job_postings.job_count, 0) BETWEEN 10 AND 50 THEN 'Medium'  
   &emsp;&emsp;     WHEN COALESCE(job_postings.job_count, 0) > 50 THEN 'Large'  
   &emsp;&emsp;     ELSE 'Unknown'  
  &emsp;  END AS company_size  
FROM company_dim  
LEFT JOIN job_postings ON company_dim.company_id = job_postings.company_id  
ORDER BY job_postings.job_count DESC;

#### Practice Problem 7

##### Find the count of the number of remote job postings per skill  
- Display the top 5 skills by their demand in remote jobs
- Include skill ID, name, and count of postings requiring the skill
- Only for Data Analysts

##### Solution

job_postings_fact: job_id -> skills_job_dim: job_id, skill_id -> skills_dim: skill_id, skills  
job_postings_fact:job_work_from_home is TRUE-> remote

-- by Luke  

WITH remote_job_skills AS (  
 &emsp;   SELECT  
  &emsp;      skills_job_dim.skill_id,  
  &emsp;      COUNT(*) AS skill_count  
 &emsp;   FROM  
  &emsp; &emsp;     skills_job_dim  
 &emsp;   INNER JOIN job_postings_fact ON skills_job_dim.job_id = job_postings_fact.job_id  
 &emsp;   WHERE job_postings_fact.job_work_from_home = TRUE  
  &emsp;        AND  
  &emsp;&emsp;          job_postings_fact.job_title_short = 'Data Analyst'    
 &emsp;   GROUP BY skills_job_dim.skill_id  
)  
  
SELECT   
 &emsp;   skills_dim.skill_id,  
 &emsp;   skills_dim.skills,  
 &emsp;   remote_job_skills.skill_count  
FROM remote_job_skills  
INNER JOIN skills_dim ON remote_job_skills.skill_id = skills_dim.skill_id  
ORDER BY remote_job_skills.skill_count DESC  
LIMIT 5;

-- by me  

WITH jobs_remote AS (  
&emsp;    SELECT  
 &emsp; &emsp;        job_postings_fact.job_id,  
  &emsp; &emsp;       job_postings_fact.job_work_from_home  
 &emsp;    FROM job_postings_fact  
 &emsp;    WHERE job_postings_fact.job_work_from_home = TRUE  
 &emsp;    AND  
   &emsp;&emsp;           job_postings_fact.job_title_short = 'Data Analyst'
),  
job_remote_skills_id AS (  
&emsp;     SELECT  
 &emsp; &emsp;        skills_job_dim.job_id,  
 &emsp; &emsp;        skills_job_dim.skill_id  
 &emsp;    FROM skills_job_dim  
 &emsp;    JOIN jobs_remote ON skills_job_dim.job_id = jobs_remote.job_id  
)

SELECT  
 &emsp;    skills_dim.skill_id,  
 &emsp;    skills_dim.skills,  
 &emsp;    COUNT(skills_dim.skills) AS skill_count  
FROM skills_dim  
JOIN job_remote_skills_id ON skills_dim.skill_id = job_remote_skills_id.skill_id  
GROUP BY skills_dim.skill_id  
ORDER BY skill_count DESC  
LIMIT 5;

-- Luke's solution optimized by ChatGPT  
  
WITH remote_job_skills AS (  
 &emsp;   SELECT  
    &emsp;     skills_job_dim.skill_id,  
   &emsp;      COUNT(*) AS skill_count  
   &emsp;  FROM  
  &emsp; &emsp;       job_postings_fact  
  &emsp;   INNER JOIN skills_job_dim  
  &emsp; &emsp;       ON skills_job_dim.job_id = job_postings_fact.job_id  
  &emsp;   WHERE  
  &emsp; &emsp;       job_postings_fact.job_work_from_home = TRUE  
   &emsp;      AND job_postings_fact.job_title_short = 'Data Analyst'  
  &emsp;   GROUP BY  
  &emsp; &emsp;       skills_job_dim.skill_id  
   &emsp;  ORDER BY  
  &emsp; &emsp;       COUNT(*) DESC  
  &emsp;   LIMIT 5  -- push limit down early to reduce rows in final join  
)  
  
SELECT   
  &emsp;   s.skill_id,  
   &emsp;  s.skills,  
  &emsp;   r.skill_count  
FROM   &emsp;
   &emsp;  remote_job_skills r  
JOIN  
   &emsp;  skills_dim s ON r.skill_id = s.skill_id;    
ORDER BY skill_count DESC  
;

## Union Operators

Combine result sets of two or more SELECT statements into a single result set.  
-- UNION: remove duplicate rows  
-- UNION ALL: Includes all duplicate rows  
!Note: Each SELECT statement within the UNION must have the same number of columns in the result sets with matching data types.  

__Essentially unions add rows to the base table, joins add columns.__   
__A union makes your results tall, a join makes it wide.__
  
Lets say you have a table on the weather.  
If you already have the columns you want, but have like, 3 months worth of new data with the same structure that you want to append, use a union.  
If you want to add new columns that give you more details about the rows you already have, say you have date and heat, but keep humidity and wind speed in a separate table, you'd use a join.

### UNION

#### Example: We exerted previously the jobs from January, February and March in different tables.  
Now put all the job_posting from those tables into a temporary set as per follow:

- Show the name of the job, the id of the company, the location of the job, and the date of job postings  
- Only for Data Analysts
- Order the whole query by the id of the company
- The final result should be 56,159


SELECT  
&emsp;    job_title_short,  
&emsp;    company_id,  
&emsp;    job_location,  
&emsp;    job_posted_date  
FROM jobs_2023_jan  
WHERE job_title_short = 'Data Analyst'  
  
UNION  
  
SELECT  
&emsp;    job_title_short,  
&emsp;    company_id,  
&emsp;    job_location,  
&emsp;    job_posted_date  
FROM jobs_2023_feb  
WHERE job_title_short = 'Data Analyst'  
  
UNION
  
SELECT  
&emsp;    job_title_short,  
&emsp;    company_id,  
&emsp;    job_location,  
&emsp;    job_posted_date  
FROM jobs_2023_mar  
WHERE job_title_short = 'Data Analyst'  
ORDER BY company_id

### UNION ALL

Return all rows, even duplicates (unlike UNION)  
Luke's personal note: He mostly uses this to combine two tables together in order to get all the data back to make sure everything is looked at.

#### Example: The same as for UNION, but now get all the rows back whether they are duplicate or not.  
- The final solution is 56,518, so we have duplicate rows

SELECT  
&emsp;    job_title_short,  
&emsp;    company_id,  
&emsp;    job_location,  
&emsp;    job_posted_date  
FROM jobs_2023_jan  
WHERE job_title_short = 'Data Analyst'  
  
UNION ALL  
  
SELECT  
&emsp;    job_title_short,  
&emsp;    company_id,  
&emsp;    job_location,  
&emsp;    job_posted_date  
FROM jobs_2023_feb  
WHERE job_title_short = 'Data Analyst'  
  
UNION ALL  
  
SELECT  
&emsp;    job_title_short,  
&emsp;    company_id,  
&emsp;    job_location,  
&emsp;    job_posted_date  
FROM jobs_2023_mar  
WHERE job_title_short = 'Data Analyst'  
ORDER BY company_id

### Practice Problem 1

#### Question:  

- Get the corresponding skill and skill type for each job postings using the tables of q1,q2 and q3.
- Include those without any skills, too  
- Why? Look at the skills and the type for each job in the first quarter that has salary > 70,000$

#### Solution

- Create a CTE first:
- Get all the necessary columns from the months tables. Make a filter.
- Make a union.
- Now you got a CTE, comes now the main part of the query with the joins, using the CTE.
- Select all the needed columns for the final result.
- Join skills_job_dim to the union, join skills_dim, too.

WITH all_jobs AS (  
&emsp;    SELECT job_id, job_title_short  
 &emsp;   FROM jobs_2023_jan   
 &emsp;    WHERE salary_year_avg > 70000  
 &emsp;    UNION ALL  
 &emsp;    SELECT job_id, job_title_short FROM jobs_2023_feb   
 &emsp;    WHERE salary_year_avg > 70000  
 &emsp;    UNION ALL  
 &emsp;    SELECT job_id, job_title_short FROM jobs_2023_mar   
 &emsp;    WHERE salary_year_avg > 70000  
)  
  
SELECT  
&emsp;     all_jobs.job_title_short,  
&emsp;     skills_dim.skills,  
&emsp;    skills_dim.type  
FROM all_jobs  
LEFT JOIN skills_job_dim ON all_jobs.job_id = skills_job_dim.job_id  
LEFT JOIN skills_dim ON skills_job_dim.skill_id = skills_dim.skill_id;

### Practice Problem 8

#### Question:  
- Find jobs from the first quarter that have a salary greater than 70.000$
- Only for Data Analysts
- Show the following columns: job_title, job location, job_via, job posted date, only date, salary year avg
- Use the 3 months tables
- Sort it by salary desc, in case there are equal salaries, then sort it further by date asc

#### Solution 1: derived table, not optimized

SELECT   
&emsp;    all_jobs_q1.job_title_short,  
&emsp;     all_jobs_q1.job_location,  
&emsp;     all_jobs_q1.job_via,  
&emsp;     all_jobs_q1.job_posted_date::DATE,  
&emsp;     all_jobs_q1.salary_year_avg  
FROM (  
&emsp;     SELECT *  
&emsp;     FROM jobs_2023_jan  
&emsp;     UNION ALL  
&emsp;     SELECT *  
&emsp;     FROM jobs_2023_feb  
&emsp;     UNION ALL  
&emsp;     SELECT *  
&emsp;     FROM jobs_2023_mar  
) AS all_jobs_q1  
WHERE   
&emsp;     all_jobs_q1.salary_year_avg > 70000   
&emsp;     AND   
&emsp;     all_jobs_q1.job_title_short = 'Data Analyst'  
ORDER BY all_jobs_q1.salary_year_avg DESC, job_posted_date ASC;

#### Solution 2: derived table, optimized

SELECT   
&emsp;    job_title_short,  
&emsp;    job_location,  
&emsp;    job_via,  
&emsp;    job_posted_date::DATE,  
&emsp;    salary_year_avg  
FROM (  
&emsp;    SELECT job_title_short, job_location, job_via, job_posted_date, salary_year_avg  
&emsp;    FROM jobs_2023_jan  
&emsp;    WHERE salary_year_avg > 70000 AND job_title_short = 'Data Analyst'  
  
&emsp;    UNION ALL  
  
&emsp;    SELECT job_title_short, job_location, job_via, job_posted_date, salary_year_avg  
&emsp;    FROM jobs_2023_feb  
&emsp;    WHERE salary_year_avg > 70000 AND job_title_short = 'Data Analyst'  
  
&emsp;    UNION ALL  
  
&emsp;    SELECT job_title_short, job_location, job_via, job_posted_date, salary_year_avg  
&emsp;    FROM jobs_2023_mar  
&emsp;    WHERE salary_year_avg > 70000 AND job_title_short = 'Data Analyst'  
)  
ORDER BY salary_year_avg DESC, job_posted_date ASC;

#### Solution 3: CTE

WITH all_jobs_q1 AS(  
&emsp;    SELECT   
&emsp;  &emsp;        job_title_short,   
&emsp;  &emsp;        job_location,   
&emsp;  &emsp;        job_via,   
&emsp;  &emsp;        job_posted_date,   
&emsp;  &emsp;        salary_year_avg  
&emsp;     FROM jobs_2023_jan  
 &emsp;    WHERE salary_year_avg > 70000  
  
 &emsp;    UNION ALL  
  
 &emsp;    SELECT   
 &emsp; &emsp;        job_title_short,   
 &emsp; &emsp;        job_location,   
 &emsp; &emsp;        job_via,   
 &emsp; &emsp;        job_posted_date,   
 &emsp; &emsp;        salary_year_avg  
 &emsp;    FROM jobs_2023_feb  
 &emsp;    WHERE salary_year_avg > 70000  
  
 &emsp;    UNION ALL  
  
 &emsp;    SELECT   
 &emsp; &emsp;        job_title_short,   
 &emsp; &emsp;        job_location,   
 &emsp; &emsp;        job_via,   
 &emsp; &emsp;        job_posted_date,   
&emsp; &emsp;         salary_year_avg  
&emsp;     FROM jobs_2023_mar  
 &emsp;    WHERE salary_year_avg > 70000  
)  
  
SELECT   
&emsp;     all_jobs_q1.job_title_short,  
 &emsp;    all_jobs_q1.job_location,  
 &emsp;    all_jobs_q1.job_via,  
&emsp;     all_jobs_q1.job_posted_date::DATE,  
&emsp;     CAST(all_jobs_q1.salary_year_avg AS INTEGER) AS salary_year_avg --truncating the decimal part  
FROM all_jobs_q1  
ORDER BY all_jobs_q1.salary_year_avg DESC;